# PressureDrop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..PressureDrop Property
Connector Class See Also
---
The pressure drop of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double PressureDrop { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PressureDrop As Double
	Get
```

Visual C++
---
```text
public:
property double PressureDrop {
	double get ();
}
```

# Remarks
Instantaneous pressure drop of this connector, calculated according to system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This connector does not support flow calculation and associated properties. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace